#Область ПрограммныйИнтерфейс
	
Функция ПолучитьИнструмент()Экспорт 
	
	Инструмент = Обработки.ОбменДанными.Создать();
	Возврат Инструмент;
КонецФункции

Функция ПолучитьДанныеОтгрузочногоЛиста(Штрихкод)Экспорт 
	
	Инструмент = ПолучитьИнструмент();
	Возврат Инструмент.ПолучитьДанныеОтгрузочногоЛиста(Штрихкод);	
КонецФункции

Функция ОтправитьДанныеОтгрузочногоЛиста(СборочныйЛист)Экспорт 
	
	Инструмент = ПолучитьИнструмент();
	Возврат Инструмент.ОтправитьДанныеОтгрузочногоЛиста(СборочныйЛист);	
КонецФункции

#КонецОбласти