#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаЧО01ОтгрузочныеЛистыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Документ.ОтгрузочныйЛист.ФормаСписка");
КонецПроцедуры


&НаКлиенте
Процедура КартинкаЧО01СНастройкиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЧО01СОчиститьБазуДанныхНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		ОчиститьБазуДанныхНажатиеНаСервере();
	Исключение   
		
		Сообщить("Ошибка очистки базы данных.");
		Возврат;
	КонецПопытки;
	
	Сообщить("База данных очищена.");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьБазуДанныхНажатиеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтгрузочныйЛист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтгрузочныйЛист КАК ОтгрузочныйЛист";
	
	Результат = Запрос.Выполнить();
	СборочныеЛисты = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
	УдалитьОбъекты(СборочныеЛисты);	
КонецПроцедуры

#КонецОбласти